#设置编码方式为utf-8，删除数据库yd，如果存在，创建数据库，进入数据库
SET NAMES UTF8;
DROP DATABASE IF EXISTS yd;
CREATE DATABASE yd CHARSET=UTF8;
USE yd;

#创建用户信息表--yd_user;
CREATE TABLE yd_user(
    user_id INT PRIMARY KEY AUTO_INCREMENT,  #用户编码
    uname VARCHAR(32),                          #用户姓名
    upwd VARCHAR(32),                           #用户密码
    email VARCHAR(64),                          #用户邮箱
    phone VARCHAR(16)                           #联系方式
);
INSERT INTO yd_user VALUES
(NULL,'dalin','123456','dalin@qq.com',15685469685),
(NULL,'doudou','123456','doudou@qq.com',13965423654),
(NULL,'meimei','123456','meimei@qq.com',18854632568),
(NULL,'feifei','123456','feifei@qq.com',13311526847);

#创建首页轮播图表：yd_index_carousel
CREATE TABLE yd_index_carousel(
    Lid INT PRIMARY KEY AUTO_INCREMENT,           #图片编码
    img VARCHAR(128),                              #图片
    title VARCHAR(64)                              #标题
);
INSERT INTO yd_index_carousel VALUES
(NULL,'http://127.0.0.1:2000/img/index1.jpg',NULL),
(NULL,'http://127.0.0.1:2000/img/index2.jpg',NULL),
(NULL,'http://127.0.0.1:2000/img/index3.jpg',NULL),
(NULL,'http://127.0.0.1:2000/img/index4.jpg',NULL),
(NULL,'http://127.0.0.1:2000/img/index5.jpg',NULL);


#创建商品类别表：yd_laptop_family
CREATE TABLE yd_laptop_family(
    fid INT PRIMARY KEY AUTO_INCREMENT,     #商品类别编码
    fname VARCHAR(32)                        #商品类别名称
);
INSERT INTO yd_laptop_family VALUES
(NULL,'特惠'),
(NULL,'火爆热销'),
(NULL,'恋人鲜花'),
(NULL,'新品上架'),
(NULL,'生日鲜花');

CREATE TABLE yd_laptop_child(
    bid INT PRIMARY KEY AUTO_INCREMENT,     #类别编码
    child VARCHAR(32)                       #名称
);
INSERT INTO yd_laptop_child VALUES
(NULL,"爱情鲜花"),
(NULL,"生日鲜花"),
(NULL,"友情鲜花"),
(NULL,"周年纪念"),
(NULL,"婚庆鲜花"),
(NULL,"祝贺鲜花"),
(NULL,"探病慰问"),
(NULL,"问候长辈"),
(NULL,"商务鲜花"),
(NULL,"缅怀追悼"),
(NULL,"道歉鲜花");

CREATE TABLE yd_laptop_list(
    pid INT PRIMARY KEY AUTO_INCREMENT,            #商品编码/商品货号
    bid  INT,                                      #商品类别编码
    style VARCHAR(128),                            #类别
    title VARCHAR(128),                            #标题
    price DECIMAL(10,2),                           #价格
    oldprice DECIMAL(10,2),                        #折前价格
    count INT,                                     #已售
    img VARCHAR(128)
);
INSERT INTO yd_laptop_list VALUES
(NULL,1,'爱的宣言','特惠',168.00,215.40,3561,'http://127.0.0.1:2000/img/1_320.jpg'),
(NULL,1,'真爱如初','折扣',236.00,240.40,2851,'http://127.0.0.1:2000/img/1_321.jpg'),
(NULL,1,'执子之手','折扣',188.00,215.40,3561,'http://127.0.0.1:2000/img/1_322.jpg'),
(NULL,1,'玫瑰之恋','热卖',168.00,215.40,5561,'http://127.0.0.1:2000/img/1_323.jpg'),
(NULL,1,'幸福听得见','折扣',166.00,215.40,5361,'http://127.0.0.1:2000/img/1_324.jpg'),
(NULL,1,'往后余生','折扣',188.00,215.40,561,'http://127.0.0.1:2000/img/1_325.jpg'),
(NULL,1,'小幸运','爆款',222.00,240.40,13561,'http://127.0.0.1:2000/img/1-326.jpg'),
(NULL,1,'遇见','爆款',520.00,550.40,5612,'http://127.0.0.1:2000/img/1-327.jpg'),
(NULL,1,'浪漫时光','精选',520.00,550.40,12543,'http://127.0.0.1:2000/img/1-328.jpg'),
(NULL,1,'捧在手心','爆款',520.00,550.40,9561,'http://127.0.0.1:2000/img/1-329.jpg'),
(NULL,1,'温暖','新品',520.00,550.40,53561,'http://127.0.0.1:2000/img/2-320.jpg'),
(NULL,1,'爱如阳光','7.8折',520.00,550.40,11561,'http://127.0.0.1:2000/img/2_321.jpg'),
(NULL,1,'钟爱一生','新品',229.00,294.00,18501,'http://127.0.0.1:2000/img/3_320.jpg'),
(NULL,1,'与你有关','新品',249.00,319.00,12571,'http://127.0.0.1:2000/img/3_321.jpg'),
(NULL,1,'浪漫之旅','新品',259.00,332.00,17031,'http://127.0.0.1:2000/img/3_322.jpg'),
(NULL,1,'甜蜜蜜','新品',276.00,354.40,19852,'http://127.0.0.1:2000/img/3_323.jpg'),
(NULL,1,'缘定三生','新品',199.00,236.40,23258,'http://127.0.0.1:2000/img/3_324.jpg'),
(NULL,1,'浓情蜜意','新品',166.00,199.90,22658,'http://127.0.0.1:2000/img/3_325.jpg'),
(NULL,1,'温馨问候','精品',188.00,220.00,36254,'http://127.0.0.1:2000/img/4_320.jpg'),
(NULL,1,'浪漫香气','精品',288.00,312.88,18965,'http://127.0.0.1:2000/img/4_321.jpg'),
(NULL,1,'感恩时刻','精品',256.00,288.66,25463,'http://127.0.0.1:2000/img/4_322.jpg'),
(NULL,1,'携手永恒','精品',188.00,210.36,17635,'http://127.0.0.1:2000/img/4_323.jpg'),
(NULL,1,'夏日柔情','精品',199.00,220.66,15364,'http://127.0.0.1:2000/img/4_324.jpg'),
(NULL,1,'生日快乐','精品',288.00,320.88,22898,'http://127.0.0.1:2000/img/4_325.jpg'),
(NULL,1,'永远年轻','热卖',288.00,320.88,22098,'http://127.0.0.1:2000/img/5_320.jpg'),
(NULL,1,'18岁','热卖',288.00,320.88,22228,'http://127.0.0.1:2000/img/5_321.jpg'),
(NULL,1,'不离不弃','热卖',288.00,320.88,11898,'http://127.0.0.1:2000/img/5_322.jpg'),
(NULL,1,'魅力甜心','热卖',288.00,320.88,10898,'http://127.0.0.1:2000/img/5_323.jpg'),
(NULL,1,'温馨祝福','热卖',288.00,320.88,20898,'http://127.0.0.1:2000/img/5_324.jpg'),
(NULL,1,'开心丸子','热卖',288.00,320.88,3898,'http://127.0.0.1:2000/img/5_325.jpg'),
(NULL,1,'爱的宣言','折扣',168.00,215.40,11561,'http://127.0.0.1:2000/img/1_320.jpg'),
(NULL,1,'真爱如初','折扣',236.00,240.40,561,'http://127.0.0.1:2000/img/1_321.jpg'),
(NULL,1,'执子之手','折扣',188.00,215.40,5361,'http://127.0.0.1:2000/img/1_322.jpg'),
(NULL,1,'玫瑰之恋','折扣',168.00,215.40,1561,'http://127.0.0.1:2000/img/1_323.jpg'),
(NULL,1,'幸福听得见','折扣',166.00,215.40,5061,'http://127.0.0.1:2000/img/1_324.jpg'),
(NULL,1,'往后余生','折扣',188.00,215.40,14561,'http://127.0.0.1:2000/img/1_325.jpg'),
(NULL,1,'小幸运','爆款',222.00,240.40,26561,'http://127.0.0.1:2000/img/1-326.jpg'),
(NULL,1,'遇见','爆款',520.00,550.40,14561,'http://127.0.0.1:2000/img/1-327.jpg'),
(NULL,1,'浪漫时光','爆款',520.00,550.40,22561,'http://127.0.0.1:2000/img/1-328.jpg'),
(NULL,1,'捧在手心','爆款',520.00,550.40,5561,'http://127.0.0.1:2000/img/1-329.jpg'),
(NULL,1,'温暖','爆款',520.00,550.40,5356,'http://127.0.0.1:2000/img/2-320.jpg'),
(NULL,1,'爱如阳光','爆款',520.00,550.40,9561,'http://127.0.0.1:2000/img/2_321.jpg'),
(NULL,1,'钟爱一生','新品',229.00,294.00,18501,'http://127.0.0.1:2000/img/3_320.jpg'),
(NULL,1,'与你有关','新品',249.00,319.00,12571,'http://127.0.0.1:2000/img/3_321.jpg'),
(NULL,1,'浪漫之旅','新品',259.00,332.00,17031,'http://127.0.0.1:2000/img/3_322.jpg'),
(NULL,1,'甜蜜蜜','新品',276.00,354.40,19852,'http://127.0.0.1:2000/img/3_323.jpg'),
(NULL,1,'缘定三生','新品',199.00,236.40,23658,'http://127.0.0.1:2000/img/3_324.jpg'),
(NULL,1,'浓情蜜意','新品',166.00,199.90,22658,'http://127.0.0.1:2000/img/3_325.jpg'),
(NULL,1,'温馨问候','精品',188.00,220.00,36254,'http://127.0.0.1:2000/img/4_320.jpg'),
(NULL,1,'浪漫香气','精品',288.00,312.88,18965,'http://127.0.0.1:2000/img/4_321.jpg'),
(NULL,1,'感恩时刻','精品',256.00,288.66,25463,'http://127.0.0.1:2000/img/4_322.jpg'),
(NULL,1,'携手永恒','精品',188.00,210.36,17635,'http://127.0.0.1:2000/img/4_323.jpg'),
(NULL,1,'夏日柔情','精品',199.00,220.66,15364,'http://127.0.0.1:2000/img/4_324.jpg'),
(NULL,1,'生日快乐','精品',288.00,320.88,2198,'http://127.0.0.1:2000/img/4_325.jpg'),
(NULL,1,'永远年轻','热卖',288.00,320.88,2898,'http://127.0.0.1:2000/img/5_320.jpg'),
(NULL,1,'18岁','热卖',288.00,320.88,2289,'http://127.0.0.1:2000/img/5_321.jpg'),
(NULL,1,'不离不弃','热卖',288.00,320.88,2298,'http://127.0.0.1:2000/img/5_322.jpg'),
(NULL,1,'魅力甜心','热卖',288.00,320.88,12898,'http://127.0.0.1:2000/img/5_323.jpg'),
(NULL,1,'温馨祝福','热卖',288.00,320.88,24898,'http://127.0.0.1:2000/img/5_324.jpg'),
(NULL,1,'开心丸子','热卖',288.00,320.88,42898,'http://127.0.0.1:2000/img/5_325.jpg'),
(NULL,2,'甜蜜蜜','新品',276.00,354.40,19852,'http://127.0.0.1:2000/img/3_323.jpg'),
(NULL,2,'缘定三生','新品',199.00,236.40,23658,'http://127.0.0.1:2000/img/3_324.jpg'),
(NULL,2,'浓情蜜意','新品',166.00,199.90,22658,'http://127.0.0.1:2000/img/3_325.jpg'),
(NULL,2,'温馨问候','精品',188.00,220.00,36254,'http://127.0.0.1:2000/img/4_320.jpg'),
(NULL,2,'浪漫香气','精品',288.00,312.88,18965,'http://127.0.0.1:2000/img/4_321.jpg'),
(NULL,2,'爱的宣言','特惠',168.00,215.40,10561,'http://127.0.0.1:2000/img/1_320.jpg'),
(NULL,2,'真爱如初','折扣',236.00,240.40,20561,'http://127.0.0.1:2000/img/1_321.jpg'),
(NULL,2,'执子之手','折扣',188.00,215.40,25361,'http://127.0.0.1:2000/img/1_322.jpg'),
(NULL,2,'玫瑰之恋','热卖',168.00,215.40,53561,'http://127.0.0.1:2000/img/1_323.jpg'),
(NULL,2,'幸福听得见','折扣',166.00,215.40,561,'http://127.0.0.1:2000/img/1_324.jpg'),
(NULL,2,'往后余生','折扣',188.00,215.40,18561,'http://127.0.0.1:2000/img/1_325.jpg'),
(NULL,2,'小幸运','爆款',222.00,240.40,16561,'http://127.0.0.1:2000/img/1-326.jpg'),
(NULL,2,'遇见','爆款',520.00,550.40,17561,'http://127.0.0.1:2000/img/1-327.jpg'),
(NULL,2,'浪漫时光','精选',520.00,550.40,535,'http://127.0.0.1:2000/img/1-328.jpg'),
(NULL,2,'捧在手心','爆款',520.00,550.40,5356,'http://127.0.0.1:2000/img/1-329.jpg'),
(NULL,2,'温暖','新品',520.00,550.40,26561,'http://127.0.0.1:2000/img/2-320.jpg'),
(NULL,2,'爱如阳光','7.8折',520.00,550.40,5561,'http://127.0.0.1:2000/img/2_321.jpg'),
(NULL,2,'钟爱一生','新品',229.00,294.00,1801,'http://127.0.0.1:2000/img/3_320.jpg'),
(NULL,2,'与你有关','新品',249.00,319.00,12571,'http://127.0.0.1:2000/img/3_321.jpg'),
(NULL,2,'浪漫之旅','新品',259.00,332.00,17031,'http://127.0.0.1:2000/img/3_322.jpg'),
(NULL,2,'感恩时刻','精品',256.00,288.66,25463,'http://127.0.0.1:2000/img/4_322.jpg'),
(NULL,2,'携手永恒','精品',188.00,210.36,17635,'http://127.0.0.1:2000/img/4_323.jpg'),
(NULL,2,'夏日柔情','精品',199.00,220.66,15364,'http://127.0.0.1:2000/img/4_324.jpg'),
(NULL,2,'生日快乐','精品',288.00,320.88,22898,'http://127.0.0.1:2000/img/4_325.jpg'),
(NULL,2,'永远年轻','热卖',288.00,320.88,2898,'http://127.0.0.1:2000/img/5_320.jpg'),
(NULL,2,'18岁','热卖',288.00,320.88,2289,'http://127.0.0.1:2000/img/5_321.jpg'),
(NULL,2,'不离不弃','热卖',288.00,320.88,21898,'http://127.0.0.1:2000/img/5_322.jpg'),
(NULL,2,'魅力甜心','热卖',288.00,320.88,24898,'http://127.0.0.1:2000/img/5_323.jpg'),
(NULL,2,'温馨祝福','热卖',288.00,320.88,12898,'http://127.0.0.1:2000/img/5_324.jpg'),
(NULL,2,'开心丸子','热卖',288.00,320.88,20898,'http://127.0.0.1:2000/img/5_325.jpg'),
(NULL,2,'爱的宣言','折扣',168.00,215.40,5561,'http://127.0.0.1:2000/img/1_320.jpg'),
(NULL,2,'真爱如初','折扣',236.00,240.40,3561,'http://127.0.0.1:2000/img/1_321.jpg'),
(NULL,2,'执子之手','折扣',188.00,215.40,5356,'http://127.0.0.1:2000/img/1_322.jpg'),
(NULL,3,'玫瑰之恋','折扣',168.00,215.40,5351,'http://127.0.0.1:2000/img/1_323.jpg'),
(NULL,3,'幸福听得见','折扣',166.00,215.40,3561,'http://127.0.0.1:2000/img/1_324.jpg'),
(NULL,3,'往后余生','折扣',188.00,215.40,50561,'http://127.0.0.1:2000/img/1_325.jpg'),
(NULL,3,'小幸运','爆款',222.00,240.40,1561,'http://127.0.0.1:2000/img/1-326.jpg'),
(NULL,3,'遇见','爆款',520.00,550.40,531,'http://127.0.0.1:2000/img/1-327.jpg'),
(NULL,3,'浪漫时光','爆款',520.00,550.40,561,'http://127.0.0.1:2000/img/1-328.jpg'),
(NULL,3,'捧在手心','爆款',520.00,550.40,17561,'http://127.0.0.1:2000/img/1-329.jpg'),
(NULL,3,'温暖','爆款',520.00,550.40,5361,'http://127.0.0.1:2000/img/2-320.jpg'),
(NULL,3,'爱如阳光','爆款',520.00,550.40,5561,'http://127.0.0.1:2000/img/2_321.jpg'),
(NULL,3,'钟爱一生','新品',229.00,294.00,18501,'http://127.0.0.1:2000/img/3_320.jpg'),
(NULL,3,'与你有关','新品',249.00,319.00,12571,'http://127.0.0.1:2000/img/3_321.jpg'),
(NULL,3,'浪漫之旅','新品',259.00,332.00,17031,'http://127.0.0.1:2000/img/3_322.jpg'),
(NULL,3,'甜蜜蜜','新品',276.00,354.40,19852,'http://127.0.0.1:2000/img/3_323.jpg'),
(NULL,3,'缘定三生','新品',199.00,236.40,23658,'http://127.0.0.1:2000/img/3_324.jpg'),
(NULL,3,'浓情蜜意','新品',166.00,199.90,22658,'http://127.0.0.1:2000/img/3_325.jpg'),
(NULL,3,'温馨问候','精品',188.00,220.00,36254,'http://127.0.0.1:2000/img/4_320.jpg'),
(NULL,3,'浪漫香气','精品',288.00,312.88,18965,'http://127.0.0.1:2000/img/4_321.jpg'),
(NULL,3,'感恩时刻','精品',256.00,288.66,25463,'http://127.0.0.1:2000/img/4_322.jpg'),
(NULL,3,'携手永恒','精品',188.00,210.36,17635,'http://127.0.0.1:2000/img/4_323.jpg'),
(NULL,3,'夏日柔情','精品',199.00,220.66,15364,'http://127.0.0.1:2000/img/4_324.jpg'),
(NULL,3,'生日快乐','精品',288.00,320.88,2288,'http://127.0.0.1:2000/img/4_325.jpg'),
(NULL,3,'永远年轻','热卖',288.00,320.88,2298,'http://127.0.0.1:2000/img/5_320.jpg'),
(NULL,3,'18岁','热卖',288.00,320.88,2289,'http://127.0.0.1:2000/img/5_321.jpg'),
(NULL,3,'不离不弃','热卖',288.00,320.88,2288,'http://127.0.0.1:2000/img/5_322.jpg'),
(NULL,3,'魅力甜心','热卖',288.00,320.88,228,'http://127.0.0.1:2000/img/5_323.jpg'),
(NULL,3,'温馨祝福','热卖',288.00,320.88,2298,'http://127.0.0.1:2000/img/5_324.jpg'),
(NULL,3,'开心丸子','热卖',288.00,320.88,2898,'http://127.0.0.1:2000/img/5_325.jpg'),
(NULL,4,'18岁','热卖',288.00,320.88,21898,'http://127.0.0.1:2000/img/5_321.jpg'),
(NULL,4,'不离不弃','热卖',288.00,320.88,23898,'http://127.0.0.1:2000/img/5_322.jpg'),
(NULL,4,'魅力甜心','热卖',288.00,320.88,22898,'http://127.0.0.1:2000/img/5_323.jpg'),
(NULL,4,'温馨祝福','热卖',288.00,320.88,28898,'http://127.0.0.1:2000/img/5_324.jpg'),
(NULL,4,'开心丸子','热卖',288.00,320.88,29898,'http://127.0.0.1:2000/img/5_325.jpg'),
(NULL,4,'爱的宣言','折扣',168.00,215.40,5661,'http://127.0.0.1:2000/img/1_320.jpg'),
(NULL,4,'真爱如初','折扣',236.00,240.40,59561,'http://127.0.0.1:2000/img/1_321.jpg'),
(NULL,4,'执子之手','折扣',188.00,215.40,5561,'http://127.0.0.1:2000/img/1_322.jpg'),
(NULL,4,'玫瑰之恋','折扣',168.00,215.40,29501,'http://127.0.0.1:2000/img/1_323.jpg'),
(NULL,4,'幸福听得见','折扣',166.00,215.40,24561,'http://127.0.0.1:2000/img/1_324.jpg'),
(NULL,4,'往后余生','折扣',188.00,215.40,12561,'http://127.0.0.1:2000/img/1_325.jpg'),
(NULL,4,'小幸运','爆款',222.00,240.40,40061,'http://127.0.0.1:2000/img/1-326.jpg'),
(NULL,4,'遇见','爆款',520.00,550.40,51161,'http://127.0.0.1:2000/img/1-327.jpg'),
(NULL,4,'浪漫时光','爆款',520.00,550.40,12561,'http://127.0.0.1:2000/img/1-328.jpg'),
(NULL,4,'捧在手心','爆款',520.00,550.40,20561,'http://127.0.0.1:2000/img/1-329.jpg'),
(NULL,4,'温暖','爆款',520.00,550.40,29561,'http://127.0.0.1:2000/img/2-320.jpg'),
(NULL,4,'爱如阳光','爆款',520.00,550.40,13561,'http://127.0.0.1:2000/img/2_321.jpg'),
(NULL,4,'钟爱一生','新品',229.00,294.00,14501,'http://127.0.0.1:2000/img/3_320.jpg'),
(NULL,4,'与你有关','新品',249.00,319.00,12571,'http://127.0.0.1:2000/img/3_321.jpg'),
(NULL,4,'浪漫之旅','新品',259.00,332.00,17031,'http://127.0.0.1:2000/img/3_322.jpg'),
(NULL,4,'甜蜜蜜','新品',276.00,354.40,19852,'http://127.0.0.1:2000/img/3_323.jpg'),
(NULL,4,'缘定三生','新品',199.00,236.40,23658,'http://127.0.0.1:2000/img/3_324.jpg'),
(NULL,4,'浓情蜜意','新品',166.00,199.90,22658,'http://127.0.0.1:2000/img/3_325.jpg'),
(NULL,4,'温馨问候','精品',188.00,220.00,36254,'http://127.0.0.1:2000/img/4_320.jpg'),
(NULL,4,'浪漫香气','精品',288.00,312.88,18965,'http://127.0.0.1:2000/img/4_321.jpg'),
(NULL,4,'感恩时刻','精品',256.00,288.66,25463,'http://127.0.0.1:2000/img/4_322.jpg'),
(NULL,4,'携手永恒','精品',188.00,210.36,17635,'http://127.0.0.1:2000/img/4_323.jpg'),
(NULL,4,'夏日柔情','精品',199.00,220.66,15364,'http://127.0.0.1:2000/img/4_324.jpg'),
(NULL,4,'生日快乐','精品',268.00,320.88,22898,'http://127.0.0.1:2000/img/4_325.jpg'),
(NULL,4,'永远年轻','热卖',288.00,320.88,15898,'http://127.0.0.1:2000/img/5_320.jpg'),
(NULL,4,'18岁','热卖',258.00,320.88,21698,'http://127.0.0.1:2000/img/5_321.jpg'),
(NULL,4,'不离不弃','热卖',230.00,320.88,12898,'http://127.0.0.1:2000/img/5_322.jpg'),
(NULL,4,'魅力甜心','热卖',220.00,320.88,21798,'http://127.0.0.1:2000/img/5_323.jpg'),
(NULL,4,'温馨祝福','热卖',210.00,320.88,22188,'http://127.0.0.1:2000/img/5_324.jpg'),
(NULL,4,'开心丸子','热卖',145.00,320.88,21998,'http://127.0.0.1:2000/img/5_325.jpg');

#创建商品详情表：yd_laptop
CREATE TABLE yd_laptop(
    pid INT PRIMARY KEY AUTO_INCREMENT,            #商品编码/商品货号
    fid  INT,                                      #商品类别编码
    style VARCHAR(128),                            #类别
    title VARCHAR(128),                            #标题
    price DECIMAL(10,2),                           #价格
    oldprice DECIMAL(10,2),                        #折前价格
    count INT,                                     #已售
    img VARCHAR(128)
);
INSERT INTO yd_laptop VALUES
(NULL,1,'爱的宣言','折扣',168.00,215.40,53561,'http://127.0.0.1:2000/img/1_320.jpg'),
(NULL,1,'真爱如初','折扣',236.00,240.40,53561,'http://127.0.0.1:2000/img/1_321.jpg'),
(NULL,1,'执子之手','折扣',188.00,215.40,53561,'http://127.0.0.1:2000/img/1_322.jpg'),
(NULL,1,'玫瑰之恋','折扣',168.00,215.40,53561,'http://127.0.0.1:2000/img/1_323.jpg'),
(NULL,1,'幸福听得见','折扣',166.00,215.40,53561,'http://127.0.0.1:2000/img/1_324.jpg'),
(NULL,1,'往后余生','折扣',188.00,215.40,53561,'http://127.0.0.1:2000/img/1_325.jpg'),
(NULL,2,'小幸运','爆款',222.00,240.40,53561,'http://127.0.0.1:2000/img/1-326.jpg'),
(NULL,2,'遇见','爆款',520.00,550.40,53561,'http://127.0.0.1:2000/img/1-327.jpg'),
(NULL,2,'浪漫时光','爆款',520.00,550.40,53561,'http://127.0.0.1:2000/img/1-328.jpg'),
(NULL,2,'捧在手心','爆款',520.00,550.40,53561,'http://127.0.0.1:2000/img/1-329.jpg'),
(NULL,2,'温暖','爆款',520.00,550.40,53561,'http://127.0.0.1:2000/img/2-320.jpg'),
(NULL,2,'爱如阳光','爆款',520.00,550.40,53561,'http://127.0.0.1:2000/img/2_321.jpg'),
(NULL,3,'钟爱一生','新品',229.00,294.00,18501,'http://127.0.0.1:2000/img/3_320.jpg'),
(NULL,3,'与你有关','新品',249.00,319.00,12571,'http://127.0.0.1:2000/img/3_321.jpg'),
(NULL,3,'浪漫之旅','新品',259.00,332.00,17031,'http://127.0.0.1:2000/img/3_322.jpg'),
(NULL,3,'甜蜜蜜','新品',276.00,354.40,19852,'http://127.0.0.1:2000/img/3_323.jpg'),
(NULL,3,'缘定三生','新品',199.00,236.40,23658,'http://127.0.0.1:2000/img/3_324.jpg'),
(NULL,3,'浓情蜜意','新品',166.00,199.90,22658,'http://127.0.0.1:2000/img/3_325.jpg'),
(NULL,4,'温馨问候','精品',188.00,220.00,36254,'http://127.0.0.1:2000/img/4_320.jpg'),
(NULL,4,'浪漫香气','精品',288.00,312.88,18965,'http://127.0.0.1:2000/img/4_321.jpg'),
(NULL,4,'感恩时刻','精品',256.00,288.66,25463,'http://127.0.0.1:2000/img/4_322.jpg'),
(NULL,4,'携手永恒','精品',188.00,210.36,17635,'http://127.0.0.1:2000/img/4_323.jpg'),
(NULL,4,'夏日柔情','精品',199.00,220.66,15364,'http://127.0.0.1:2000/img/4_324.jpg'),
(NULL,4,'生日快乐','精品',288.00,320.88,22898,'http://127.0.0.1:2000/img/4_325.jpg'),
(NULL,5,'永远年轻','热卖',288.00,320.88,22898,'http://127.0.0.1:2000/img/5_320.jpg'),
(NULL,5,'18岁','热卖',288.00,320.88,22898,'http://127.0.0.1:2000/img/5_321.jpg'),
(NULL,5,'不离不弃','热卖',288.00,320.88,22898,'http://127.0.0.1:2000/img/5_322.jpg'),
(NULL,5,'魅力甜心','热卖',288.00,320.88,22898,'http://127.0.0.1:2000/img/5_323.jpg'),
(NULL,5,'温馨祝福','热卖',288.00,320.88,22898,'http://127.0.0.1:2000/img/5_324.jpg'),
(NULL,5,'开心丸子','热卖',288.00,320.88,22898,'http://127.0.0.1:2000/img/5_325.jpg');


#创建商品图片表：yd_product_pic
CREATE TABLE yd_product_pic(
    pid INT PRIMARY KEY AUTO_INCREMENT,       #图片编号
    product_id INT,                          #所属商品编码
    zid INT,                                   #类别码
    sm  VARCHAR(128),                          #小图
    md  VARCHAR(128),                          #中图
    lg VARCHAR(128),                            #大图
    big VARCHAR(128)                            #放大镜图
);


#创建用户购物车表：yd_shopping_cart
CREATE TABLE yd_shopping_cart(
tid INT PRIMARY KEY AUTO_INCREMENT,          #编码
user_id INT,                                 #用户编码
product_id INT,                              #商品编码
count INT,                                   #数量
price INT,
is_checked bool                               #是否勾选
);
INSERT INTO yd_shopping_cart VALUES
(1,1,3,2,188.00,NULL),
(NULL,4,1,1,168.00,NULL),
(NULL,2,2,1,168.00,NULL),
(NULL,2,4,3,168.00,NULL),
(NULL,3,3,2,266.00,NULL),
(NULL,2,1,1,238.00,NULL),
(NULL,2,3,1,199.00,NULL);

#创建商品页表：yd_details
CREATE TABLE yd_details(
    bid INT PRIMARY KEY AUTO_INCREMENT,            #列表编码
    pid INT,                                       #商品编码/商品货号
    title VARCHAR(128),                             #标题
    obj VARCHAR(32),                               #适合对象
    purpose VARCHAR(32),                           #适合用途
    flower VARCHAR(32),                            #花材
    num INT,                                      #枝数
    color VARCHAR(32),                              #颜色
    categort VARCHAR(32),                           #类别
    say VARCHAR(32),                                #商品花语
    packing VARCHAR(32),                            #包装
    main VARCHAR(32),                               #主花材
    cation VARCHAR(32),                            #搭配花材
    sm 	VARCHAR(128)                                #图片
);
INSERT INTO yd_details VALUES
(1,1,"幸福听的见-11朵红玫瑰，一对小熊，搭配相思梅，栀子叶","恋人","爱情鲜花，生日鲜花","花材","11枝","红色","创意花盒","你是我童话里的白雪公主，我就是你今生今世的爱情奴仆","黑色硬质托底包装，高档精美礼盒","11朵玫瑰花，一对小熊","相思梅，栀子叶","http://127.0.0.1:2000/img/laptop/sm/1_224.jpg"),
(NULL,2,"捧在手心 - 11枝红玫瑰，搭配满天星","恋人","爱情鲜花 , 周年纪念","花材","11枝","红色","花束","很爱你，想把你捧在手心，放在心里","白色雾面纸内衬，灰色卡纸外包，精美花结","11朵玫瑰花，一对小熊","满天星","http://127.0.0.1:2000/img/laptop/sm/1_224.jpg"),
(NULL,3,"携手永恒 - 9朵白玫瑰，搭配白色桔梗、情人草、白色相思梅，绿叶","恋人","爱情鲜花，生日鲜花","花材","11枝","红色","创意花盒","永恒不变则是爱情最美的约定","白色雾面纸内衬，蓝色雾面纸外包，精美花结","9朵白玫瑰","白色桔梗、情人草、白色相思梅，绿叶","http://127.0.0.1:2000/img/laptop/sm/1_224.jpg"),
(NULL,4,"幸福听的见-11朵红玫瑰，一对小熊，搭配相思梅，栀子叶","恋人","爱情鲜花，生日鲜花","花材","11枝","红色","创意花盒","你是我童话里的白雪公主，我就是你今生今世的爱情奴仆","黑色硬质托底包装，高档精美礼盒","11朵玫瑰花，一对小熊","相思梅，栀子叶","http://127.0.0.1:2000/img/laptop/sm/1_224.jpg"),
(NULL,5,"幸福听的见-11朵红玫瑰，一对小熊，搭配相思梅，栀子叶","恋人","爱情鲜花，生日鲜花","花材","11枝","红色","创意花盒","你是我童话里的白雪公主，我就是你今生今世的爱情奴仆","黑色硬质托底包装，高档精美礼盒","11朵玫瑰花，一对小熊","相思梅，栀子叶","http://127.0.0.1:2000/img/laptop/sm/1_224.jpg"),
(NULL,6,"幸福听的见-11朵红玫瑰，一对小熊，搭配相思梅，栀子叶","恋人","爱情鲜花，生日鲜花","花材","11枝","红色","创意花盒","你是我童话里的白雪公主，我就是你今生今世的爱情奴仆","黑色硬质托底包装，高档精美礼盒","11朵玫瑰花，一对小熊","相思梅，栀子叶","http://127.0.0.1:2000/img/laptop/sm/1_224.jpg"),
(NULL,7,"幸福听的见-11朵红玫瑰，一对小熊，搭配相思梅，栀子叶","恋人","爱情鲜花，生日鲜花","花材","11枝","红色","创意花盒","你是我童话里的白雪公主，我就是你今生今世的爱情奴仆","黑色硬质托底包装，高档精美礼盒","11朵玫瑰花，一对小熊","相思梅，栀子叶","http://127.0.0.1:2000/img/laptop/sm/1_224.jpg");

